{"/docs/":{"data":{"":"OpenRelik is a powerful, open-source platform designed to streamline and enhance your digital forensic investigations. Whether you’re a seasoned professional or just starting your journey in the field, this documentation hub is your go-to resource.\nGetting started: Detailed guides to help you install OpenRelik on your preferred environment and configure it for your needs. Key Concepts: Understand the fundamental principles behind OpenRelik and how it facilitates a structured, efficient approach to digital forensics. Workflows: Explore how OpenRelik’s flexible workflow system allows you to customize your investigations and collaborate seamlessly with your team. Getting started Key concepts Workflows "},"title":"Documentation"},"/docs/api/":{"data":{"":"Api api api"},"title":"API docs"},"/docs/getting-started/":{"data":{"":"Install the stuff neeeded"},"title":"Getting started"},"/docs/key-concepts/":{"data":{"":"","#":"Forensic Artifacts Uploaded and Stored: Forensic artifacts are uploaded to the platform and stored as files on the server. Organization: Users can create folders to efficiently organize and manage their uploaded forensic artifacts. Workflows Docker Containers: Workflows are built using independent Docker containers, ensuring isolation and portability. Communication: These containers interact with the core system through task queue signals, enabling seamless coordination and data exchange. Pipelines and Parallel Execution: Workflows can be executed as sequential pipelines or as groups of parallel tasks, providing flexibility and optimization for various forensic investigations. Intuitive User Interface: Workflows are designed and created using an intuitive user interface, empowering users to easily define and configure their forensic analysis processes. Copying and Sharing: Workflows can be easily copied and shared between users, fostering collaboration and knowledge exchange. Workflow Templates: Users can create and store workflow templates, allowing for quick and efficient reuse of workflows for different evidence sets. Artifact Summaries LLM Integration: The platform can connect to Large Language Model (LLM) services to generate concise and informative summaries of forensic artifacts, aiding investigators in quickly understanding their relevance and potential significance. Additional Considerations Open-Source: The platform is open-source, encouraging community contributions, transparency, and continuous improvement. Scalability: The system is designed to scale efficiently, accommodating growing volumes of forensic data and user activity. data. "},"title":"Key concepts"},"/docs/workflows/":{"data":{"":"What is a workflow anyways?"},"title":"Workflows"}}